[
  "obsidian-pandoc",
  "obsidian-citation-plugin",
  "dataview",
  "find-unlinked-files",
  "zoteronotes",
  "obsidian-to-notion",
  "open-vscode",
  "obsidian-excalidraw-plugin",
  "obsidian-tasks-plugin",
  "tag-wrangler",
  "obsidian-zotero-desktop-connector",
  "metadata-menu",
  "cmdr",
  "obsidian-advanced-uri",
  "obsidian-reminder-plugin",
  "markwhen",
  "google-calendar",
  "marp-slides",
  "obsidian-pandoc-reference-list",
  "obsidian-git",
  "obsidian-local-rest-api",
  "copilot"
]