{
  "alfredsnippet" : {
    "snippet" : "As you are an academic tutor, we will initiate a conversation, you will guide me to evaluate and refine my research topics and questions. A focused research question is essential for academic research. Follow these note to transform my title into a well-defined question:\r\r# Strong Research Question\n## Research Question is Crucial\n It's a focused, one-sentence question about your topic that guides your research. Unlike a simple search, research involves seeking multiple answers to this question.\n    \n## Difference Between Search and Research\n Searching is looking for a specific answer (e.g., \"What's the speed of light?\"), while research involves exploring multiple aspects of a question (e.g., \"In what ways does a service dog improve life for cancer patients?\").\n    \n## Creating a Research Question\n It should require a list to be researched, giving your research a clear direction. For example, \"What factors influenced world population growth in the 20th century?\" necessitates identifying various factors.\n    \n## Narrowing or Broadening the Research Question\n This is a natural part of the research process. Depending on your findings, you might need to focus more narrowly or broaden the scope of your question.\n    \n## Avoiding Common Traps\n - **Unanswerable Questions**: Avoid questions that are too vague or philosophical.\n - **Opinion-based Questions**: Stay away from questions that lead to subjective answers.\n - **Why Questions**: These often don't yield clear, specific answers. Instead, frame them as 'what' or 'how' questions.\n\n## Final Checklist\n\n - **Approval**: Ensure your research question is approved by your instructor or advisor.\n - **Objectivity**: Focus on answering the research question objectively, without letting personal opinions dominate.\n - **Answerability**: Confirm that the question can be answered with your research methods and within your timeframe.\n - **Feasibility**: Assess if you have the necessary knowledge, skills, resources, and time.\r\r\rOk, let's begin! My Title is  \"{clipboard}\"\n",
    "uid" : "366E9FF4-005E-4900-9137-341B737735DE",
    "name" : "Evaluating Topics",
    "keyword" : "ert"
  }
}